import 'experiment.dart';

final mockExperiments = <Experiment>[
  Experiment(01, '实验室制取氢气', '实验室制取氢气常用锌与稀硫酸反应，化学式：Zn+H2SO4=ZnSO4+H2↑','需要检查制装置的气密性;试管口要略低于试管底。'),
  Experiment(02, '实验室制取蒸馏水', '蒸馏是分离和提纯液态混合物常用的方法之一','小心使用酒精灯，避免被烫伤。'),
  Experiment(
      03, '过氧化氢制取氧气', '过氧化氢也称为双氧水，是实验室常用的制作氧气的方法之一，化学式：2H2O2=MnO2=2H2O+O2↑','需要检查制装置的气密性;试管口要略低于试管底。'),
  Experiment(
      04, '酸碱中和滴定反应', '在酚酞溶液中先加入盐酸，后逐滴滴加氢氧化钠，现象为先无色后红色，化学式：HCl+NaOH=NaCl+H2O','为了使指示剂的变色不发生异常导致误差，中和滴定时指示剂的用量不可过多，温度不宜过高，强酸或强碱的浓度不宜过大。'),
  Experiment(
      05, '高锰酸钾制取氧气', '实验室使用高锰酸钾高温加热后生成固体锰酸钾、二氧化锰和氧气。','试管口塞上棉花，防止固体粉末进入导管'),
  Experiment(
      06, '电解水', '在一个盛有水的水槽中倒立两支盛满水的试管，接通直流电源，电极上产生气泡。','水中可加入少量硫酸钠或氢氧化钠来增强导电性。'),
  Experiment(
      07, '木炭还原氧化铜', '把刚烘干的木炭粉末和氧化铜粉末混匀，用酒精灯加热混合物几分钟后黑色粉末逐渐变为红色，石灰水变浑浊。','实验结束时先把导管从石灰水中移除，再撤回酒精灯，避免石灰水倒流。'),
  Experiment(
      08, '实验室制取二氧化碳', '用稀盐酸与块状大理石或石灰石反应生成二氧化碳','需要检查制装置的气密性;试管口要略低于试管底。'),
];
